# Project 1

In [1]:
import pandas as pd
df=pd.read_csv(r"C:\Resource\Sample data\data1.csv")
df

        city  humidity  temp
0        Hyd      34.0  56.0
1        kkd      45.0  67.0
2        vzg      56.0   NaN
3        Hyd      23.0  32.0
4        vzg      34.0  89.0
5        kkd       NaN  67.0
6  Bangalore      78.0  67.0
7      Delhi      65.0  41.0
8     Mumbai       NaN  33.0
9    Chennai      70.0   NaN

In [2]:
df.isnull()

    city  humidity   temp
0  False     False  False
1  False     False  False
2  False     False   True
3  False     False  False
4  False     False  False
5  False      True  False
6  False     False  False
7  False     False  False
8  False      True  False
9  False     False   True

# Exploring data

In [3]:
df.head()

  city  humidity  temp
0  Hyd      34.0  56.0
1  kkd      45.0  67.0
2  vzg      56.0   NaN
3  Hyd      23.0  32.0
4  vzg      34.0  89.0

In [4]:
df.tail()

        city  humidity  temp
5        kkd       NaN  67.0
6  Bangalore      78.0  67.0
7      Delhi      65.0  41.0
8     Mumbai       NaN  33.0
9    Chennai      70.0   NaN

In [5]:
df['temp']=df['temp'].fillna(df['temp'].mean())
df

        city  humidity  temp
0        Hyd      34.0  56.0
1        kkd      45.0  67.0
2        vzg      56.0  56.5
3        Hyd      23.0  32.0
4        vzg      34.0  89.0
5        kkd       NaN  67.0
6  Bangalore      78.0  67.0
7      Delhi      65.0  41.0
8     Mumbai       NaN  33.0
9    Chennai      70.0  56.5

In [6]:
df['humidity']=df['humidity'].fillna(df['humidity'].sum())
df

        city  humidity  temp
0        Hyd      34.0  56.0
1        kkd      45.0  67.0
2        vzg      56.0  56.5
3        Hyd      23.0  32.0
4        vzg      34.0  89.0
5        kkd     405.0  67.0
6  Bangalore      78.0  67.0
7      Delhi      65.0  41.0
8     Mumbai     405.0  33.0
9    Chennai      70.0  56.5

In [7]:
df.shape

(10, 3)

In [8]:
df.columns

Index(['city', 'humidity', 'temp'], dtype='object')

In [9]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [10]:
df.dtypes

city         object
humidity    float64
temp        float64
dtype: object

In [11]:
df.city

0          Hyd
1          kkd
2          vzg
3          Hyd
4          vzg
5          kkd
6    Bangalore
7        Delhi
8       Mumbai
9      Chennai
Name: city, dtype: object

In [12]:
df.info

<bound method DataFrame.info of         city  humidity  temp
0        Hyd      34.0  56.0
1        kkd      45.0  67.0
2        vzg      56.0  56.5
3        Hyd      23.0  32.0
4        vzg      34.0  89.0
5        kkd     405.0  67.0
6  Bangalore      78.0  67.0
7      Delhi      65.0  41.0
8     Mumbai     405.0  33.0
9    Chennai      70.0  56.5>

In [13]:
df[2:6]

  city  humidity  temp
2  vzg      56.0  56.5
3  Hyd      23.0  32.0
4  vzg      34.0  89.0
5  kkd     405.0  67.0

## creating a database

In [15]:
data=({
    "Name":["Alice","Bob","Charlie","David","Eve","Frank","George"],
    "Age": [12,23,45,67,23,23,12]
})
df

        city  humidity  temp
0        Hyd      34.0  56.0
1        kkd      45.0  67.0
2        vzg      56.0  56.5
3        Hyd      23.0  32.0
4        vzg      34.0  89.0
5        kkd     405.0  67.0
6  Bangalore      78.0  67.0
7      Delhi      65.0  41.0
8     Mumbai     405.0  33.0
9    Chennai      70.0  56.5

In [16]:
df.tail()

        city  humidity  temp
5        kkd     405.0  67.0
6  Bangalore      78.0  67.0
7      Delhi      65.0  41.0
8     Mumbai     405.0  33.0
9    Chennai      70.0  56.5

In [17]:
df.head()

  city  humidity  temp
0  Hyd      34.0  56.0
1  kkd      45.0  67.0
2  vzg      56.0  56.5
3  Hyd      23.0  32.0
4  vzg      34.0  89.0

In [18]:
df.shape

(10, 3)

In [19]:
df.dtypes

city         object
humidity    float64
temp        float64
dtype: object

In [20]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [21]:
df.isnull()

    city  humidity   temp
0  False     False  False
1  False     False  False
2  False     False  False
3  False     False  False
4  False     False  False
5  False     False  False
6  False     False  False
7  False     False  False
8  False     False  False
9  False     False  False

In [22]:
df.info

<bound method DataFrame.info of         city  humidity  temp
0        Hyd      34.0  56.0
1        kkd      45.0  67.0
2        vzg      56.0  56.5
3        Hyd      23.0  32.0
4        vzg      34.0  89.0
5        kkd     405.0  67.0
6  Bangalore      78.0  67.0
7      Delhi      65.0  41.0
8     Mumbai     405.0  33.0
9    Chennai      70.0  56.5>

In [23]:
df[2:6]

  city  humidity  temp
2  vzg      56.0  56.5
3  Hyd      23.0  32.0
4  vzg      34.0  89.0
5  kkd     405.0  67.0

In [24]:
df['temp']=df['temp'].fillna(df['temp'].mean())
df

        city  humidity  temp
0        Hyd      34.0  56.0
1        kkd      45.0  67.0
2        vzg      56.0  56.5
3        Hyd      23.0  32.0
4        vzg      34.0  89.0
5        kkd     405.0  67.0
6  Bangalore      78.0  67.0
7      Delhi      65.0  41.0
8     Mumbai     405.0  33.0
9    Chennai      70.0  56.5

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   city      10 non-null     object
 1   humidity  10 non-null     float64
 2   temp      10 non-null     float64
dtypes: float64(2), object(1)
memory usage: 372.0+ bytes